Model: "model_1"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_3 (InputLayer)            [(None, 64, 64, 64)] 0                                            
__________________________________________________________________________________________________
reshape_1 (Reshape)             (None, 64, 64, 64, 1 0           input_3[0][0]                    
__________________________________________________________________________________________________
conv3d (Conv3D)                 (None, 32, 32, 32, 6 2097216     reshape_1[0][0]                  
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 32, 32, 32, 6 256         conv3d[0][0]                     
__________________________________________________________________________________________________
leaky_re_lu (LeakyReLU)         (None, 32, 32, 32, 6 0           batch_normalization_4[0][0]      
__________________________________________________________________________________________________
conv3d_1 (Conv3D)               (None, 16, 16, 16, 1 33554560    leaky_re_lu[0][0]                
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, 16, 16, 16, 1 512         conv3d_1[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_1 (LeakyReLU)       (None, 16, 16, 16, 1 0           batch_normalization_5[0][0]      
__________________________________________________________________________________________________
conv3d_2 (Conv3D)               (None, 8, 8, 8, 256) 16777472    leaky_re_lu_1[0][0]              
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (None, 8, 8, 8, 256) 1024        conv3d_2[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_2 (LeakyReLU)       (None, 8, 8, 8, 256) 0           batch_normalization_6[0][0]      
__________________________________________________________________________________________________
conv3d_3 (Conv3D)               (None, 4, 4, 4, 512) 8389120     leaky_re_lu_2[0][0]              
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (None, 4, 4, 4, 512) 2048        conv3d_3[0][0]                   
__________________________________________________________________________________________________
activation (Activation)         (None, 4, 4, 4, 512) 0           batch_normalization_7[0][0]      
__________________________________________________________________________________________________
max_pooling3d (MaxPooling3D)    (None, 2, 2, 2, 128) 0           leaky_re_lu_1[0][0]              
__________________________________________________________________________________________________
max_pooling3d_1 (MaxPooling3D)  (None, 2, 2, 2, 256) 0           leaky_re_lu_2[0][0]              
__________________________________________________________________________________________________
max_pooling3d_2 (MaxPooling3D)  (None, 2, 2, 2, 512) 0           activation[0][0]                 
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 2, 2, 2, 896) 0           max_pooling3d[0][0]              
                                                                 max_pooling3d_1[0][0]            
                                                                 max_pooling3d_2[0][0]            
__________________________________________________________________________________________________
flatten (Flatten)               (None, 7168)         0           concatenate[0][0]                
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 10)           71690       flatten[0][0]                    
==================================================================================================
Total params: 60,893,898
Trainable params: 60,891,978
Non-trainable params: 1,920
__________________________________________________________________________________________________
