Model: "Generator"
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
reshape (Reshape)            (None, 1, 1, 1, 100)      0
_________________________________________________________________
conv3d_transpose (Conv3DTran (None, 4, 4, 4, 512)      3276800
_________________________________________________________________
batch_normalization (BatchNo (None, 4, 4, 4, 512)      2048
_________________________________________________________________
re_lu (ReLU)                 (None, 4, 4, 4, 512)      0
_________________________________________________________________
conv3d_transpose_1 (Conv3DTr (None, 8, 8, 8, 256)      67108864
_________________________________________________________________
batch_normalization_1 (Batch (None, 8, 8, 8, 256)      1024
_________________________________________________________________
re_lu_1 (ReLU)               (None, 8, 8, 8, 256)      0
_________________________________________________________________
conv3d_transpose_2 (Conv3DTr (None, 16, 16, 16, 128)   134217728
_________________________________________________________________
batch_normalization_2 (Batch (None, 16, 16, 16, 128)   512
_________________________________________________________________
re_lu_2 (ReLU)               (None, 16, 16, 16, 128)   0
_________________________________________________________________
conv3d_transpose_3 (Conv3DTr (None, 32, 32, 32, 64)    268435456
_________________________________________________________________
batch_normalization_3 (Batch (None, 32, 32, 32, 64)    256
_________________________________________________________________
re_lu_3 (ReLU)               (None, 32, 32, 32, 64)    0
_________________________________________________________________
conv3d_transpose_4 (Conv3DTr (None, 64, 64, 64, 1)     16777216
=================================================================
Total params: 489,819,904
Trainable params: 489,817,984
Non-trainable params: 1,920
_________________________________________________________________





Model: "Discriminator"
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
reshape_1 (Reshape)          (None, 64, 64, 64, 1)     0
_________________________________________________________________
conv3d (Conv3D)              (None, 32, 32, 32, 64)    2097216
_________________________________________________________________
batch_normalization_4 (Batch (None, 32, 32, 32, 64)    256
_________________________________________________________________
leaky_re_lu (LeakyReLU)      (None, 32, 32, 32, 64)    0
_________________________________________________________________
conv3d_1 (Conv3D)            (None, 16, 16, 16, 128)   33554560
_________________________________________________________________
batch_normalization_5 (Batch (None, 16, 16, 16, 128)   512
_________________________________________________________________
leaky_re_lu_1 (LeakyReLU)    (None, 16, 16, 16, 128)   0
_________________________________________________________________
conv3d_2 (Conv3D)            (None, 8, 8, 8, 256)      16777472
_________________________________________________________________
batch_normalization_6 (Batch (None, 8, 8, 8, 256)      1024
_________________________________________________________________
leaky_re_lu_2 (LeakyReLU)    (None, 8, 8, 8, 256)      0
_________________________________________________________________
conv3d_3 (Conv3D)            (None, 4, 4, 4, 512)      8389120
_________________________________________________________________
batch_normalization_7 (Batch (None, 4, 4, 4, 512)      2048
_________________________________________________________________
activation (Activation)      (None, 4, 4, 4, 512)      0
_________________________________________________________________
reshape_2 (Reshape)          (None, 32768)             0
_________________________________________________________________
dense (Dense)                (None, 1)                 32769
=================================================================
Total params: 60,854,977
Trainable params: 60,853,057
Non-trainable params: 1,920
_________________________________________________________________